# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент,
# второй и предпоследний и т.д.
#
# Пример:
#
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

n = int(input('Введите колличество чисел списка: '))
sp = []
print('Введите числа списка: ')
for i in range(n):
    sp.append(int(input()))
print(sp)
new_sp = []
for i in range(int(n / 2 + n % 2)):
    new_sp.append(sp[i] * sp[-1 - i])
print(new_sp)