# 6.	Напишите программу, в которой пользователь будет задавать две строки, а программа -
# определять количество вхождений одной строки в другой.

n1 = 'vvrrjklffggdddtttedssswaaaajjjfffgghhbbbvvvccccccxxxddeeerttyyuuiiokkjjhhgg'
n2 = 'c'

print(n1.count(n2))