# 4.	Обработка текста
# Напишите программу для обработки текста.
# На вход вашей программы подаётся многострочный текст, причём число строк заранее неизвестно.
# Ваша задача – пронумеровать слова в нём, начиная с нуля, а затем вывести только те слова, которые начинаются с большой буквы.
# Перед словом необходимо вывести номер первого вхождения этого слова в текст.
# Слова необходимо отсортировать в лексикографическом порядке. (В решении задачи поможет функция enumerate())
# Входные данные	            Выходные данные
# Ехал Грека через реку.        4 - Видит
# Видит Грека в реке рак.       1 - Грека
# Сунул в реку руку Грека.      17 - Греку
# Рак за руку Греку цап.        0 - Ехал
#                               14 - Рак
#                               9 - Сунул

